---
kind: property
id: P:Autodesk.Revit.DB.SweptBlend.TopProfileSymbol
source: html/711dc6b4-f9ed-d97d-7a92-189e1918176e.htm
---
# Autodesk.Revit.DB.SweptBlend.TopProfileSymbol Property

The top family symbol profile of the swept blend.

## Syntax (C#)
```csharp
public FamilySymbolProfile TopProfileSymbol { get; }
```

## Remarks
If the top profile is sketch-based, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .